ping 172.16.20.39 data ABCD df-bit repeat 1000 size 1472 source 10.8.25.1

-------------------------------------------------------------------------------------------------------

Router# ping
Protocol [ip]: 
Target IP address: 172.16.20.39
Repeat Count [5]: 100
Datagram Size [100]: 
Timeout in seconds [2]:
Extended commands [n]: y
Source address or interface: loopback0
Type of service [0]:
Set DF bit in IP header? [no]:
Validate reply data? [no]:
Data pattern [0xABCD]:
Loose, Strict, Record, Timestamp, Verbose [none]: 
Sweep range of sizes [n]:

-------------------------------------------------------------------------------------------------------

Router# traceroute 
Protocol [ip]: 
Target IP address: 172.16.20.39 
Source address: 10.8.25.1 
Numeric display [n]: 
Timeout in seconds [3]: 
Probe count [3]: 
Minimum Time to Live [1]: 
Maximum Time to Live [30]: 
Port Number [33434]: 
Loose, Strict, Record, Timestamp, Verbose[none]: 

--------------------------------------------------------------------------------------------------------

Router# traceroute 192.168.10.13

Type escape sequence to abort
Tracing the route to 192.168.10.13

    1	172.16.0.2     2 msec    2 msec      2 msec
    2  172.16.1.3	 24 msec   16 msec     20 msec
    3	172.16.1.19	 42 msec   37 msec	   40 msec
Router#

---------------------------------------------------------------------------------------------------------

Router# traceroute 192.168.10.13
Type escape sequence to abort
Tracing the route to 192.168.10.13
    1	172.16.0.2     2 msec    2 msec      2 msec
    2  172.16.1.3	 10 msec   12 msec     16 msec
    3	172.16.1.19	 15 msec   18 msec	   21 msec
    4	172.16.1.3	 20 msec   23 msec	   26 msec
    5	172.16.1.19	 26 msec   29 msec	   31 msec

!! Press CTRL+SHIFT+6 to abort.

Router#

----------------------------------------------------------------------------------------------------------

Router# show interfaces ethernet 0
 
Ethernet 0 is up, line protocol is up
  Hardware is MCI Ethernet, address is 0000.0c00.750c (bia 0000.0c00.750c)
  Internet address is 131.108.28.8, subnet mask is 255.255.255.0
  MTU 1500 bytes, BW 10000 Kbit, DLY 100000 usec, rely 255/255, load 1/255
  Encapsulation ARPA, loopback not set, keepalive set (10 sec)
  ARP type: ARPA, ARP Timeout 4:00:00
  Last input 0:00:00, output 0:00:00, output hang never
  Last clearing of "show interface" counters 0:00:00
  Output queue 0/40, 0 drops; input queue 0/75, 0 drops
  Five minute input rate 0 bits/sec, 0 packets/sec
  Five minute output rate 2000 bits/sec, 4 packets/sec
     1127576 packets input, 447251251 bytes, 0 no buffer
     Received 354125 broadcasts, 0 runts, 0 giants, 57186* throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     5332142 packets output, 496316039 bytes, 0 underruns
     0 output errors, 432 collisions, 0 interface resets, 0 restarts
...

----------------------------------------------------------------------------------------------------------

Switch# show interfaces gigabitethernet 4/1 status 
Port 	Name 	Status 	Vlan 	Duplex 	Speed 	Type 
Gi4/1 		err-disabled 100 	  full 	 1000  1000BaseSX
Switch#

----------------------------------------------------------------------------------------------------------

Router# show ip interface gigabitethernet 0/3 
GigabitEthernet0/3 is up, line protocol is up
  Internet address is 10.1.1.1/16
  Broadcast address is 255.255.255.255
  . . 
  MTU is 1500 bytes
  Helper address is not set
  . . 
  Outgoing access list is not set
  Inbound access list is not set
  Proxy ARP is enabled
  Local Proxy ARP is disabled
  Security level is default
  Split horizon is enabled
  ICMP redirects are always sent
  ICMP unreachables are always sent
  ICMP mask replies are never sent
  . . 
  Policy routing is enabled, using route map PBR
  Network address translation is disabled
  . . 

-----------------------------------------------------------------------------------------------------------

Router# show ip interface brief | include up
Interface             IP-Address      OK?    Method Status     	Protocol
GigabitEthernet0/1    unassigned      YES    unset  up         	up
GigabitEthernet0/2    192.168.190.235 YES    unset  up         	up
GigabitEthernet0/3    unassigned      YES    unset  up         	up
GigabitEthernet0/4    192.168.191.2   YES    unset  up         	up
TenGigabitEthernet2/1 unassigned      YES    unset  up         	up
TenGigabitEthernet2/2 unassigned      YES    unset  up         	up
TenGigabitEthernet2/3 unassigned      YES    unset  up         	up

------------------------------------------------------------------------------------------------------------

Switch# show vlan

VLAN	Name			Status		Ports
----  --------------	-----	---------	--------------------------
1	default		active		Eth0/0, Eth0/2, Eth1/0, Eth1/1
						Eth1/2, Eth1/3, Eth2/0, Eth2/1
						Eth2/2, Eth2/3
10	VLAN0010		active		Eth0/1, Eth0/3
20	VLAN0020		active	

-------------------------------------------------------------------------------------------------------------

Switch# show interfaces trunk

Port		Mode		Encapsulation	  Status	Native vlan
Eth3/0		desirable	802.1q		  trunking	1

Port 		Vlans allowed on trunk
Eth3/0		10,20,30

Port 		Vlans allowed and active in management domain
Eth3/0		10,20,30

Port 		Vlans in spanning tree forwarding state and not pruned
Eth3/0		10,20,30

-------------------------------------------------------------------------------------------------------------

Switch# show mac-address-table
 
Dynamic Addresses Count:               4
Secure Addresses (User-defined) Count: 0
Static Addresses (User-defined) Count: 0
System Self Addresses Count:           41
Total MAC addresses:                   45
Non-static Address Table:
Destination Address  Address Type  VLAN  Destination Port
-------------------  ------------  ----  --------------------
0010.0de0.e289       Dynamic          1  FastEthernet0/1
0010.7b00.1540       Dynamic          2  FastEthernet0/5
0010.7b00.1545       Dynamic          2  FastEthernet0/5
0060.5cf4.0076       Dynamic          1  FastEthernet0/1

--------------------------------------------------------------------------------------------------------------

Router# show arpProtocol  Address     Age (min)  Hardware Addr   Type   InterfaceInternet  10.8.10.2          4   0010.0de0.e289  ARPA   FastEthernet0/0Internet  10.8.10.13         1   0010.7b00.1545  ARPA   FastEthernet0/0R2# 

---------------------------------------------------------------------------------------------------------------

Router_1# show standby 
Vlan10 - Group 10 
  Local state is Active, priority 110, may preempt
  Hellotime 3 holdtime 10 
  Next hello sent in 00:00:00.216 
  Hot standby IP address is 192.168.10.100 configured 
  Active router is local 
  Standby router is 192.168.10.2 expires in 00:00:08 
  Standby virtual mac address is 0000.0c07.ac0a 
  8 state changes, last state change 00:18:04

---------------------------------------------------------------------------------------------------------------

Router# show vrrp 
Ethernet0/1 - Group 1 
State is Master 
Virtual IP address is 10.21.0.10 
Virtual MAC address is 0000.5e00.0101 
Advertisement interval is 1.000 sec 
Preemption is enabled 
 min delay is 0.000 sec 
Priority is 100
 Authentication MD5, key-string, timeout 30 secs 
Master Router is 10.21.0.1 (local), priority is 100 
Master Advertisement interval is 1.000 sec 
. . . . 

---------------------------------------------------------------------------------------------------------------

Router1#: debug vrrp authentication 
VRRP: Sent: 21016401FE050000AC1801FE0000000000000000 
VRRP: HshC: B861CBF1B9026130DD34AED849BEC8A1 
VRRP: Rcvd: 21016401FE050000AC1801FE0000000000000000 
VRRP: HshC: B861CBF1B9026130DD34AED849BEC8A1 
VRRP: HshR: C5E193C6D84533FDC750F85FCFB051E1 
VRRP: Grp 1 Adv from 172.24.1.2 has failed MD5 auth

---------------------------------------------------------------------------------------------------------------

Router# show ip route
 
Codes: L – local, C – connected, S – static, R - RIP, M – mobile, B – BGP
 	D - EIGRP, EX - EIGRP external, O – OSPF, IA – OSPF inter area
	N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
	E1 - OSPF external type 1, E2 - OSPF external type 2 	
	i - IS-IS, su – IS-IS summary L1– IS-IS level-1, L2 – IS-IS level-2
 
--- Output trimmed ----

Gateway of last resort is not set
     1.0.0.0/24 is subnetted, 1 subnets 
O E2 	 1.0.0.0 [110/20] via 10.0.0.1, 0:01:30, Ethernet0/2
     2.0.0.0/24 is subnetted, 1 subnets 
S 	 2.0.0.0 [1/0] via 3.1.1.2
     3.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C	 3.1.1.0/24 is directly connected, Ethernet0/1
L	 3.1.1.1/32 is directly connected, Ethernet0/1
     100.0.0.0/24 is subnetted, 1 subnets
O	 100.200.9.0 [110/20] via 10.0.0.1, 00:05:37, Ethernet0/2
     192.268.1.2/32 is subnetted, 1 subnets
O	 192.168.1.2 [110/11] via 10.0.0.1, 00:05:37, Ethernet0/2
     200.1.0.1/32 is subnetted, 1 subnets
O	 200.1.0.1 [110/11] via 10.0.0.1, 00:05:37, Ethernet0/2

---------------------------------------------------------------------------------------------------------------

Device# show ip ospf neighbor 
Neighbor ID 	   Pri     State        Dead Time   Address        Interface 10.199.199.137    1      FULL/DR      0:00:31   192.168.80.37   Ethernet0 172.16.48.1       1      FULL/DROTHER 0:00:33   172.16.48.1     Ethernet1
172.16.48.200     1      FULL/DROTHER 0:00:33   172.16.48.200   Ethernet1

----------------------------------------------------------------------------------------------------------------

Router# show ip access-lists
Extended IP access list 150
   10 deny icmp any any (5 matches)
   20 permit ip ay any (8 matches)

Router#

----------------------------------------------------------------------------------------------------------------

Router# show processes cpu
 
CPU utilization for five seconds: 0%/0%; one minute: 0%; five minutes: 0%
 PID Runtime(uS)     Invoked      uSecs   5Sec   1Min   5Min TTY Process 
   1        4000          67         59  0.00%  0.00%  0.00%   0 Chunk Manager  
   2        4000      962255          0  0.00%  0.00%  0.00%   0 Load Meter     
   3           0           1          0  0.00%  0.00%  0.00%   0 cpf_process_tp 
   4           0           1          0  0.00%  0.00%  0.00%   0 EDDRI_MAIN     
   5   586520704      732013       6668  0.00%  0.11%  0.08%   0 Check heaps    
   6        4000         991          4  0.00%  0.00%  0.00%   0 Pool Manager   
   7           0           1          0  0.00%  0.00%  0.00%   0 DiscardQ Backg 
   8           0           2          0  0.00%  0.00%  0.00%   0 Timers         
   9           0           2          0  0.00%  0.00%  0.00%   0 ATM AutoVC Per 
  10           0           2          0  0.00%  0.00%  0.00%   0 ATM VC Auto Cr 

----------------------------------------------------------------------------------------------------------------

Router# show memory summary
 
                Head    Total(b)     Used(b)     Free(b)   Lowest(b)  Largest(b)
Processor   61E379A0    27035232     8089056    18946176    17964108    17963664
      I/O    3800000     8388608     2815088     5573520     5561520     5573472

------------------------------------------------------------------------------------------------------------------
